
&НаКлиенте
Процедура DR_ПоказатьТабличныйДокумент(Элемент)
	DR_ПоказатьТабличныйДокументПриИзмененииНаСервере();
КонецПроцедуры 

&НаСервере
Процедура DR_ПоказатьТабличныйДокументПриИзмененииНаСервере()
	Константы.DR_ПоказатьТабличныйДокумент.Установить(ПоказатьТабличныйДокумент);
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	DR_СохранитьНаСервере();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура DR_СохранитьНаСервере()
	
	Попытка
	Отбор = Новый Структура("Провайдер", Провайдер);
	//Отбор.Провайдер = Провайдер;
	Выборка = РегистрыСведений.DR_НастройкиАдаптера.Выбрать(Отбор);
	Если Выборка.Следующий() Тогда
        Запись = Выборка.ПолучитьМенеджерЗаписи();
	    Запись.Прочитать();
		Иначе Запись = РегистрыСведений.DR_НастройкиАдаптера.СоздатьМенеджерЗаписи();
	КонецЕсли;
		Запись.Провайдер = Провайдер;
		Запись.АдресСервиса = АдресСервиса;
		Запись.АдресРесурса = АдресРесурса;
		Запись.Порт 		= Порт; 
		Запись.Таймаут		= Таймаут;
		Запись.ApiKey 		= ApiKey;
		Запись.Промпт 		= Промпт;
	    Запись.Записать(Истина);
		
	Константы.DR_АктивныйАдаптер.Установить(Провайдер);	
	
	Исключение
		ВызватьИсключение ОписаниеОшибки();
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура DR_ПрочитатьНаСервере()
	
	Если ЗначениеЗаполнено(Провайдер) Тогда
		Отбор = Новый Структура("Провайдер", Провайдер);
		Выборка = РегистрыСведений.DR_НастройкиАдаптера.Выбрать(Отбор);
		Если Выборка.Следующий() Тогда
	        Запись = Выборка.ПолучитьМенеджерЗаписи();
		    Запись.Прочитать();
			//АдресСервиса = Запись.АдресСервиса;
			//АдресРесурса = Запись.АдресРесурса;
			//Порт 		 = Запись.Порт; 
			Таймаут 	 = Запись.Таймаут;
			ApiKey 		 = Запись.ApiKey;
			Промпт 		 = Запись.Промпт;
            Запись.Записать(Истина);
		КонецЕсли;
		ПолучитьНастройкиПровайдера();
	КонецЕсли;
	
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Провайдер = Константы.DR_АктивныйАдаптер.Получить();
	DR_ПрочитатьНаСервере();
	АК = "39670275068fcb1302f3c0aa123eedc4717d3d9c";
	ПоказатьТабличныйДокумент = Константы.DR_ПоказатьТабличныйДокумент.Получить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПровайдерПриИзменении(Элемент)
	
	АдресСервиса = "";
	АдресРесурса = "";
	Порт 		 = ""; 
	Таймаут 	 = "";
	ApiKey 		 = "";

	DR_ПрочитатьНаСервере();
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	
	Если НЕ ЗначениеЗаполнено(Провайдер) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.АК.Видимость = (Провайдер = "PaddleOCR"); 
	Элементы.ГруппаПропмт.Видимость = (Провайдер = "MistralOCR");
	ТекстОписание = ПолучитьТекстИзМакета("ТекПараметр" + Провайдер);
	Элементы.MistralPrompt.Видимость = Ложь; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.MistralPrompt.Заголовок = ПолучитьТекстИзМакета("MistralPrompt");
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьТекстИзМакета(ТекПараметр)
	
	Макет = Обработки.DR_РаспознаваниеДокументов.ПолучитьМакет("МакетТекст");
	Если НЕ Макет.Области.Найти(ТекПараметр) = Неопределено Тогда
		Возврат Макет.Области[ТекПараметр].Текст;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПримерПромпта(Команда)
	Элементы.MistralPrompt.Видимость = НЕ Элементы.MistralPrompt.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура ТекстОписаниеПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СсылкаНаРесурс = "";
	СтандартнаяОбработка = Ложь;
	ДанныеСобытия.Свойство("href", СсылкаНаРесурс);
	Если Не ЗначениеЗаполнено(СсылкаНаРесурс) Тогда
            Возврат;
	КонецЕсли; 
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(СсылкаНаРесурс);	
		
КонецПроцедуры

&НаСервере
Процедура ПолучитьНастройкиПровайдера()
	
	Если ЗначениеЗаполнено(Провайдер) Тогда	
		Если Провайдер = "MistralOCR" Тогда
			АдресСервиса = "api.mistral.ai";
			АдресРесурса = "/v1/ocr";
			Порт 		 = 0; 
		ИначеЕсли Провайдер = "PaddleOCR" Тогда
			АдресСервиса = "paddleocr.aistudio-app.com";
			АдресРесурса = "/api/v2/ocr/jobs";
			Порт 		 = 0; 
		Конецесли;
	КонецЕсли;
	
КонецПроцедуры

