////////////////////////////////////////////////////////////////////////////////
// 
// Copyright (C) 2026 Yezhi-NI
// SPDX-License-Identifier: AGPL-3.0-only
// Project: https://github.com/Yezhi-NI/DoRIS
// Contact: https://t.me/afterdev  
//
////////////////////////////////////////////////////////////////////////////////
//
// DoRIS(Дорис)
//
// Общий модуль:
//      DR_PaddleCloudProvider
//
// Назначение:
//      Провайдер PaddleOCR Cloud API.
//
////////////////////////////////////////////////////////////////////////////////

Функция ВыполнитьРаспознавание(Настройки, СтруктураФайла) Экспорт

	Попытка

		ДвоичныеДанные = ПолучитьИзВременногоХранилища(СтруктураФайла.АдресФайла);

		Если ДвоичныеДанные = Неопределено Тогда
			Возврат СоздатьРезультат(,, "Не удалось получить файл из временного хранилища.");
		КонецЕсли;
		
		УдалитьИзВременногоХранилища(СтруктураФайла.АдресФайла);
		
		HTTPЗапрос_ = СоздатьHTTPЗапрос(
			Настройки.Сервер,
			Настройки.АдресСервиса,
			ПолучитьЗаголовки(Настройки),
			ПолучитьПараметры(Настройки),
			ДвоичныеДанные,
			СтруктураФайла.ТипФайла);

		HTTPОтвет = DR_HttpClient.ОтправитьPOSTЗапрос(HTTPЗапрос_);

		Если Не DR_HttpClient.ПроверитьHTTPОтвет(HTTPОтвет) Тогда
			Возврат СоздатьРезультат(,, HTTPОтвет.Ошибка);
		КонецЕсли;

		JobID = ПолучитьОтветJSON(HTTPОтвет.Тело, "jobId");

		Если ПустаяСтрока(JobID) Тогда
			Возврат СоздатьРезультат(,, "Не удалось получить JobID.");
		КонецЕсли;

		Возврат ОжидатьЗавершения(JobID, Настройки);

	Исключение

		Возврат СоздатьРезультат(,, ОписаниеОшибки());

	КонецПопытки;

КонецФункции

Функция СоздатьHTTPЗапрос( URL, АдресСервиса, Заголовки, Параметры = Неопределено, ДвоичныеДанные = Неопределено, ТипФайла = "") 

	HTTPЗапрос_ = DR_HttpClient.ПолучитьСтруктуруHTTPЗапроса();

	HTTPЗапрос_.URL = URL;
	HTTPЗапрос_.Заголовки = Заголовки;
	HTTPЗапрос_.Параметры = Параметры;
	HTTPЗапрос_.ДвоичныеДанные = ДвоичныеДанные;
	HTTPЗапрос_.ТипФайла = ТипФайла;
	HTTPЗапрос_.ИмяПоляФайла = "file";
    HTTPЗапрос_.АдресСервиса = АдресСервиса;
	
	Возврат HTTPЗапрос_;

КонецФункции

Функция ПолучитьЗаголовки(Настройки)

	Заголовки = Новый Структура;
	Заголовки.Вставить("Authorization", "bearer " + Настройки.ApiKey);

	Возврат Заголовки;

КонецФункции

Функция ПолучитьПараметры(Настройки)

	Параметры = Новый Структура;
	Параметры.Вставить("model", "PaddleOCR-VL-1.6");
	Параметры.Вставить("optionalPayload", ПолучитьOptionalPayload());

	Возврат Параметры;

КонецФункции

Функция ПолучитьOptionalPayload()

	OptionalPayload = Новый Структура;

	OptionalPayload.Вставить("useDocOrientationClassify", Ложь);
	OptionalPayload.Вставить("useDocUnwarping", Ложь);
	OptionalPayload.Вставить("useChartRecognition", Ложь);
	OptionalPayload.Вставить("visualize", Ложь);
	OptionalPayload.Вставить("mergeTables", Истина);
	//OptionalPayload.Вставить("minPixels", 100000);

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, OptionalPayload);

	Возврат ЗаписьJSON.Закрыть();

КонецФункции    

Функция ОжидатьЗавершения(JobID, Настройки)
	
	КоличествоВыполнений = 0;
    
	Пока Истина Цикл

		HTTPЗапрос_ = СоздатьHTTPЗапрос(Настройки.Сервер, Настройки.АдресСервиса + "/" + JobID, 
					ПолучитьЗаголовки(Настройки));

		HTTPОтвет = DR_HttpClient.ОтправитьGETЗапрос(HTTPЗапрос_);

		Если Не DR_HttpClient.ПроверитьHTTPОтвет(HTTPОтвет) ИЛИ ЗначениеЗаполнено(HTTPОтвет.Ошибка) Тогда
			Возврат СоздатьРезультат(,, HTTPОтвет.Ошибка);
		КонецЕсли;

		Состояние = ПолучитьОтветJSON(HTTPОтвет.Тело, "state");

		Если Состояние = "done" Тогда
			Возврат ПолучитьJSONОтвет(JobID, HTTPОтвет.Тело, Настройки, HTTPОтвет.Заголовки);
		КонецЕсли;

		Если Состояние = "failed" ИЛИ Состояние = "" Тогда
			Возврат СоздатьРезультат(,, ПолучитьОтветJSON(HTTPОтвет.Тело, "errorMsg"));
		КонецЕсли;
		
		КоличествоВыполнений = КоличествоВыполнений + 1;
		Если КоличествоВыполнений >= 20 Тогда
			Возврат СоздатьРезультат(,, "Не получен ответ от сервера");	
		КонецЕсли;
		
		//пауза
		Пауза(5);
		//для 8.3.25 использовать
		//ВызватьПаузу (5000);
		
	КонецЦикла;

КонецФункции

// Получение итогового JSON
Функция ПолучитьJSONОтвет(JobID, JSONОтветСтатуса, Настройки, Заголовки)

	URLJSON = ПолучитьОтветJSON(JSONОтветСтатуса, "resultUrl");    
	
	Если ПустаяСтрока(URLJSON.jsonUrl) Тогда
		Возврат СоздатьРезультат(,, "Не удалось получить URL результата.");
	КонецЕсли;
	
	СтруктураЗапроса = ПолучитьСтруктуруЗапроса(URLJSON.jsonUrl);
	HTTPЗапрос = СоздатьHTTPЗапрос(СтруктураЗапроса.Сервер, СтруктураЗапроса.АдресСервиса, Неопределено);
	
	HTTPОтвет = DR_HttpClient.ОтправитьGETЗапрос(HTTPЗапрос);

	Если Не DR_HttpClient.ПроверитьHTTPОтвет(HTTPОтвет) Тогда
		Возврат СоздатьРезультат(,, HTTPОтвет.Ошибка);
	КонецЕсли;
	
	СтруктураДокументов = РазобратьОтветPaddle(HTTPОтвет.Тело);
	Возврат СоздатьРезультат(JobID, HTTPОтвет.Тело, СтруктураДокументов.ТекстОшибки,
		СтруктураДокументов.МассивДокументов);

КонецФункции

Функция ПолучитьОтветJSON(JSONОтвет, Данные)
	
	Попытка
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(JSONОтвет);
    Ответ = ПрочитатьJSON(ЧтениеJSON);                                                     
	ЧтениеJSON.Закрыть();
	
	Возврат Ответ.data[Данные];
	
	Исключение Возврат "";
	КонецПопытки;
	
КонецФункции

Функция СоздатьРезультат(JobID = "", JSONОтвет = "", ТекстОшибки = "", МассивДокументов = Неопределено)

	Результат = Новый Структура;

	Результат.Вставить("JobID", JobID);
	Результат.Вставить("ТипОтвета", DR_Settings.ТипыОтветовOCR().PaddleOCR);
	Результат.Вставить("JSONОтвет", JSONОтвет);
	Результат.Вставить("МассивДокументов", МассивДокументов);
	Результат.Вставить("Статус", ?(ЗначениеЗаполнено(ТекстОшибки), DR_Settings.СтатусыРаспознавания().Ошибка, 
						DR_Settings.СтатусыРаспознавания().Успешно));
	Результат.Вставить("Ошибка", ТекстОшибки);

	Возврат Результат;

КонецФункции

Функция ПолучитьСтруктуруЗапроса(ТекстURL)

	Результат = Новый Структура;
	
	Индекс = СтрНайти(ТекстURL, "/v1/job/");
	ДлинаСтрокиАдресаСервиса = СтрДлина(ТекстURL); 
	
	АдресСервиса = Сред(ТекстURL, Индекс, ДлинаСтрокиАдресаСервиса - Индекс + 1);
	Сервер = СтрЗаменить(Лев(ТекстURL, Индекс -1), "https://","");
	
	Результат.Вставить("АдресСервиса", АдресСервиса);
	Результат.Вставить("Сервер", Сервер);

	Возврат Результат;

КонецФункции

Процедура Пауза(Знач Секунд) 
	
	ОбщегоНазначенияБТС.Пауза(Секунд);
 
КонецПроцедуры

Функция РазобратьОтветPaddle(РезультатOCR)
	
	//для теста
	//Markdown = ПолучитьОбщийМакет("DR_тест1").ПолучитьТекст();
	//---------
    СтруктураРаспознанныхДокументов = Новый Структура("ТекстОшибки, МассивДокументов");
	СтруктураРаспознанныхДокументов.МассивДокументов = Новый Массив;
	
	Markdown = ПолучитьРезультатPaddle(РезультатOCR);
		
	Если ПустаяСтрока(Markdown) Тогда
		СтруктураРаспознанныхДокументов.ТекстОшибки = "Markdown отсутствует.";
		Возврат СтруктураРаспознанныхДокументов;  
	КонецЕсли;

	РезультатРазбораMarkdown = РазобратьMarkdownPaddle(Markdown, СтруктураРаспознанныхДокументов);

	Возврат РезультатРазбораMarkdown;

КонецФункции

// Получение Markdown из ответа PaddleOCR
Функция ПолучитьРезультатPaddle(JSONОтвет)
	
	ОтветJSON = РазобратьJSON(JSONОтвет);
	
	Если ОтветJSON = Неопределено Тогда
		Возврат "";
	КонецЕсли;

	Если НЕ ОтветJSON.Свойство("result") Тогда
		Возврат "";
	КонецЕсли;

	Если НЕ ОтветJSON.result.Свойство("layoutParsingResults") Тогда
		Возврат "";
	КонецЕсли;

	Markdown = "";

	Для Каждого РезультатРазбора Из ОтветJSON.result.layoutParsingResults Цикл

		Если НЕ РезультатРазбора.Свойство("markdown") Тогда
			Продолжить;
		КонецЕсли;

		Если НЕ РезультатРазбора.markdown.Свойство("text") Тогда
			Продолжить;
		КонецЕсли;

		Если НЕ ПустаяСтрока(Markdown) Тогда
			Markdown = Markdown + Символы.ПС + Символы.ПС;
		КонецЕсли;

		Markdown = Markdown + РезультатРазбора.markdown.text;

	КонецЦикла;

	Возврат Markdown;

КонецФункции

Функция РазобратьMarkdownPaddle(Markdown, СтруктураРаспознанныхДокументов)

	СтрокиMarkdown = СтрРазделить(Markdown, Символы.ПС);
	
	Документ = Новый Структура;
	//шапка, подвал и тп
	СтрокиДокумента = Новый Массив;
	//таблицы товаров
	ТаблицыТоваров = Новый Массив;
	
	Для Каждого СтрокаMarkdown Из СтрокиMarkdown Цикл

		СтрокаMarkdown = СокрЛП(СтрокаMarkdown);

		Если ПустаяСтрока(СтрокаMarkdown) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭтоТаблица(СтрокаMarkdown) Тогда
			РазобратьТаблицу(СтрокаMarkdown, ТаблицыТоваров);
			Продолжить;
        КонецЕсли;
		
		//если обычная строка, то добавляем в СтрокиДокумента
		СтрокиДокумента.Добавить(СтрокаMarkdown);
		
	КонецЦикла;
	
	Документ.Вставить("СтрокиДокумента", СтрокиДокумента);
	Документ.Вставить("ТаблицыТоваров", ТаблицыТоваров);
	СтруктураРаспознанныхДокументов.МассивДокументов.Добавить(Документ);
	
	Возврат СтруктураРаспознанныхДокументов;
	
КонецФункции 

Функция ЭтоТаблица(СтрокаMarkdown)
	
    Возврат СтрНачинаетсяС(НРег(СтрокаMarkdown), "<table") 
			И СтрЗаканчиваетсяНа(НРег(СтрокаMarkdown),"</table>");
	
КонецФункции

Функция РазобратьJSON(СтрокаJSON)

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);

	Попытка
		Возврат ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
	Исключение
		ЧтениеJSON.Закрыть();
	КонецПопытки;

КонецФункции  

Процедура РазобратьТаблицу(СтрокаMarkdown, ТаблицыТоваров)

	ЧтениеHTML = Новый ЧтениеHTML;
	ЧтениеHTML.УстановитьСтроку(СтрокаMarkdown, "UTF-8");
    ПостроительDOM = Новый ПостроительDOM;
    ДокументHTML = ПостроительDOM.Прочитать(ЧтениеHTML);
    
    // Находим все таблицы в исходном файле
    Таблицы = ДокументHTML.ПолучитьЭлементыПоИмени("table");
	
	Для Каждого Таблица Из Таблицы Цикл

		// Ищем строки таблиц
        СтрокиТаблицы = Таблица.ПолучитьЭлементыПоИмени("tr");
		ТаблицаМассив = Новый Массив;
				
		Для Каждого СтрокаТаблицы Из СтрокиТаблицы Цикл 
			СтрокаМассив = Новый Массив;
	        Колонки = СтрокаТаблицы.ПолучитьЭлементыПоИмени("td");
		    Для Каждого Колонка Из Колонки Цикл  
                Для каждого ЭлементУзла Из Колонка.ДочерниеУзлы Цикл
					Если ЭлементУзла.ИмяУзла = "#text" Тогда
						СтрокаМассив.Добавить(ЭлементУзла.ЗначениеУзла);
                    КонецЕсли;
                КонецЦикла;
			КонецЦикла;
			ТаблицаМассив.Добавить(СтрокаМассив);
		КонецЦикла;	
		
	ТаблицыТоваров.Добавить(ТаблицаМассив);	
		
	КонецЦикла;		
	
КонецПроцедуры










