////////////////////////////////////////////////////////////////////////////////
// 
// Copyright (C) 2026 Yezhi-NI
// SPDX-License-Identifier: AGPL-3.0-only
// Project: https://github.com/Yezhi-NI/DoRIS
// Contact: https://t.me/afterdev  
//
////////////////////////////////////////////////////////////////////////////////
//
// DoRIS(Дорис)
//
// Общий модуль: DR_DocumentProcessor
//
// Назначение:
// 	Обработка результатов OCR.
// 	Преобразует ответ OCR в универсальную структуру Document.
//
////////////////////////////////////////////////////////////////////////////////

Функция Обработать(РезультатOCR) Экспорт

	DR_Validation.ПроверитьТипСтруктура(РезультатOCR, "РезультатOCR");

	Попытка

		Если РезультатOCR.Статус = DR_Settings.СтатусыРаспознавания().Ошибка Тогда
			Возврат СоздатьРезультатОшибки(РезультатOCR.Ошибка);
		КонецЕсли;

		Если РезультатOCR.ТипОтвета = DR_Settings.ТипыОтветовOCR().PaddleOCR Тогда
			Возврат РазобратьОтвет(РезультатOCR);
		ИначеЕсли РезультатOCR.ТипОтвета = DR_Settings.ТипыОтветовOCR().MistralOCR Тогда
			Возврат РазобратьОтвет(РезультатOCR);
		  КонецЕсли;

		Возврат СоздатьРезультатОшибки("Неизвестный тип OCR-провайдера.");

	Исключение

		Возврат СоздатьРезультатОшибки(ОписаниеОшибки());

	КонецПопытки;

КонецФункции 

Функция РазобратьОтвет(РезультатOCR)
	
	Если РезультатOCR.МассивДокументов = Неопределено ИЛИ 
		НЕ ТипЗнч(РезультатOCR.МассивДокументов) = Тип("Массив") Тогда
	   	Возврат СоздатьРезультатОшибки("Markdown отсутствует.");
   	КонецЕсли;
	
	Документ = DR_DocumentFactory.СоздатьСтруктуруДокумент();
	
	Для Каждого ДокументOCR ИЗ РезультатOCR.МассивДокументов Цикл
		Документ.МассивСтрок = ДокументOCR.СтрокиДокумента;
		Если ДокументOCR.ТаблицыТоваров = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		РазобратьДокументOCR(ДокументOCR, Документ);

	КонецЦикла;

	Возврат СоздатьРезультатДокумента(Документ, РезультатOCR.JSONОтвет);

КонецФункции

Процедура РазобратьДокументOCR(ДокументOCR, Документ)
	
	//пока только Документ---
	Документ.ТипОбъекта = "Документ";
	//-----------------------
	
	ТаблицаТоваров = РазобратьТаблицыТоваров(ДокументOCR);
	ЗаполнитьТабличнуюЧасть(ТаблицаТоваров, Документ);
	
КонецПроцедуры 

Процедура ЗаполнитьТабличнуюЧасть(ТаблицаТоваров, Документ)
	
	Для Каждого СтрокаТоваров ИЗ ТаблицаТоваров Цикл
			
		НоваяСтрока = Документ.ТабличнаяЧасть.Добавить();
	    ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТоваров);
		//НоваяСтрока.ЕИ = ПолучитьСтроковуюЧасть(НоваяСтрока.Количество);
		НоваяСтрока.Количество = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(НоваяСтрока.Количество); 
		
		Если ЗначениеЗаполнено(НоваяСтрока.Цена) Тогда
			НоваяСтрока.Цена = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(НоваяСтрока.Цена);
		Иначе НоваяСтрока.Цена = 0;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НоваяСтрока.Сумма) Тогда
			НоваяСтрока.Сумма = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(НоваяСтрока.Сумма);
		Иначе НоваяСтрока.Сумма = 0;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НоваяСтрока.СуммаНДС) Тогда
			НоваяСтрока.СуммаНДС = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(НоваяСтрока.СуммаНДС);
		Иначе НоваяСтрока.СуммаНДС = 0;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НоваяСтрока.СуммаБезНДС) Тогда
			НоваяСтрока.СуммаБезНДС = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(НоваяСтрока.СуммаБезНДС);
		Иначе НоваяСтрока.СуммаБезНДС = 0;
		КонецЕсли;
	
	КонецЦикла;
 
КонецПроцедуры 

#Область Таблицы

Функция РазобратьТаблицыТоваров(ДокументOCR)

    Результат = Новый Массив;

    Если ДокументOCR.ТаблицыТоваров.Количество() = 0 Тогда
        Возврат Результат;
    КонецЕсли;

    СхемаКолонок = СоздатьСхемуКолонок(ДокументOCR);

    Для ИндексТаблицы = 0 ПО ДокументOCR.ТаблицыТоваров.Количество() - 1 Цикл

        ТаблицаТоваров = ДокументOCR.ТаблицыТоваров[ИндексТаблицы];

        ЕстьЗаголовок = ИндексТаблицы = 0;

        ВариантСхемы = ОпределитьВариантСхемыТаблицы(ТаблицаТоваров, СхемаКолонок, ЕстьЗаголовок);

        Если ВариантСхемы = "НесовместимаяСхема" Тогда
            Продолжить;
        КонецЕсли;

        НачальныйИндекс = 0;

        Если ЕстьЗаголовок Тогда
            НачальныйИндекс = 1;
        КонецЕсли;

        Для ИндексСтроки = НачальныйИндекс ПО ТаблицаТоваров.Количество() - 1 Цикл

            Строка = РазобратьСтрокуПоСхеме(ТаблицаТоваров[ИндексСтроки], СхемаКолонок, ВариантСхемы);
            Результат.Добавить(Строка);

        КонецЦикла;

    КонецЦикла;

    Возврат СоздатьТаблицуТоваров(Результат, СхемаКолонок);

КонецФункции

Функция СоздатьТаблицуТоваров(МассивСтрокТоваров, СхемаКолонок)

    Таблицатоваров = Новый ТаблицаЗначений;
	Если МассивСтрокТоваров.Количество() = 0 Тогда
		Возврат ТаблицаТоваров;
	КонецЕсли;
	
	СоответствияНаименованийКолонок = DR_DocumentFactory.СоответствиеКолонок(); 
	Ключ = 1;
	Для Каждого ИмяДляКолонки ИЗ СхемаКолонок Цикл
	
		ИмяКолонки = СоответствияНаименованийКолонок.Получить(ИмяДляКолонки.Имя); 
		Если ИмяКолонки = Неопределено Тогда 
			ТаблицаТоваров.Колонки.Добавить("Колонка" + Ключ, , ИмяДляКолонки.Имя); 
		Иначе
			ТаблицаТоваров.Колонки.Добавить(ИмяКолонки, , ИмяКолонки);
		КонецЕсли; 
		
	    Ключ = Ключ + 1;
 
	КонецЦикла;	
	
	Для Каждого СтрокаТоваров ИЗ МассивСтрокТоваров Цикл 
		НоваяСтрока = Таблицатоваров.Добавить();
		Для ИндексКолонки = 0 По СтрокаТоваров.Количество() - 1 Цикл 
			НоваяСтрока[ИндексКолонки] = СтрокаТоваров[ИндексКолонки];
		КонецЦикла;
	КонецЦикла;

	Возврат Таблицатоваров;

КонецФункции

Функция РазобратьСтрокуПоСхеме(СтрокаТаблицы, СхемаКолонок, ВариантСхемы)

    Результат = Новый Массив;

    Если ВариантСхемы = "НесовместимаяСхема" Тогда
        Возврат Результат;
    КонецЕсли;

    ИндексЛогическойКолонки = 0;
    ИндексФизическойКолонки = 0;

    Пока ИндексЛогическойКолонки < СхемаКолонок.Количество() Цикл

        Колонка = СхемаКолонок[ИндексЛогическойКолонки];

        // физические ячейки закончились.
        // оставшиеся логические колонки заполняем пустыми значениями.

        Если ИндексФизическойКолонки >= СтрокаТаблицы.Количество() Тогда
            Результат.Добавить("");
            ИндексЛогическойКолонки = ИндексЛогическойКолонки + 1;
            Продолжить;

        КонецЕсли;

        Значение = СокрЛП(СтрокаТаблицы[ИндексФизическойКолонки]);

        Если ВариантСхемы = "ОбъединеннаяСхема" И Колонка.Расширяемая Тогда

            ЧисловаяЧасть = ПолучитьЧисловуюЧасть(Значение);
        	СтроковаяЧасть = ПолучитьСтроковуюЧасть(Значение);

            Если СтроковаяЧасть <> "" Тогда

                Результат.Добавить(ЧисловаяЧасть);
                Результат.Добавить(СтроковаяЧасть);
                ИндексФизическойКолонки = ИндексФизическойКолонки + 1;
                ИндексЛогическойКолонки = ИндексЛогическойКолонки + 2;
                Продолжить;

            КонецЕсли;

        КонецЕсли;

        Результат.Добавить(Значение);
        ИндексФизическойКолонки = ИндексФизическойКолонки + 1;
        ИндексЛогическойКолонки = ИндексЛогическойКолонки + 1;

    КонецЦикла;

    Возврат Результат;

КонецФункции

Функция СоздатьСхемуКолонок(ДокументOCR)

    СхемаКолонок = Новый Массив;

    Если ДокументOCR.ТаблицыТоваров.Количество() = 0 Тогда
        Возврат СхемаКолонок;
    КонецЕсли;

    ПерваяТаблица = ДокументOCR.ТаблицыТоваров[0];

    Если ПерваяТаблица.Количество() = 0 Тогда
        Возврат СхемаКолонок;
    КонецЕсли;

    Заголовки = ПерваяТаблица[0];
    ПравилаРасширения = ПолучитьПравилаРасширенияКолонок();

    КоличествоКолонокЗаголовка = Заголовки.Количество();
    КоличествоКолонокСтроки = КоличествоКолонокЗаголовка;

    Если ПерваяТаблица.Количество() > 1 Тогда
        КоличествоКолонокСтроки = ПерваяТаблица[1].Количество();
    КонецЕсли;

    РазницаКолонок = КоличествоКолонокСтроки - КоличествоКолонокЗаголовка;

    КоличествоРасширяемыхКолонок = 0;

    Для Каждого Заголовок Из Заголовки Цикл

        Правило = ПолучитьПравилоРасширенияКолонки(Заголовок, ПравилаРасширения);

        Если Правило <> Неопределено Тогда
            КоличествоРасширяемыхКолонок = КоличествоРасширяемыхКолонок + 1;
        КонецЕсли;

    КонецЦикла;

    Для ИндексКолонки = 0 По Заголовки.Количество() - 1 Цикл

        ИмяКолонки = СокрЛП(Заголовки[ИндексКолонки]);

        Правило = ПолучитьПравилоРасширенияКолонки(ИмяКолонки, ПравилаРасширения);

        Колонка = Новый Структура;
        Колонка.Вставить("Имя", ИмяКолонки);
        Колонка.Вставить("Расширяемая", Ложь);
        Колонка.Вставить("ИмяДополнительнойКолонки", "");

        Если Правило <> Неопределено Тогда

            Колонка.Расширяемая = Истина;

            Колонка.ИмяДополнительнойКолонки = Правило.ИмяДополнительнойКолонки;

        КонецЕсли;

        СхемаКолонок.Добавить(Колонка);

        Если Правило = Неопределено Тогда
            Продолжить;
        КонецЕсли;

        НужноРасширить = Ложь;

        // вариант 1:
        // количество физических колонок совпадает
        // с заголовком, но значение содержит
        // две логические части, например "1,000 шт".

        Если ПерваяТаблица.Количество() > 1
            И ПерваяТаблица[1].Количество() > ИндексКолонки Тогда

            Значение = СокрЛП(ПерваяТаблица[1][ИндексКолонки]);
            НужноРасширить = ПроверитьПоследнийСимволВСтроке(Значение);

        КонецЕсли;

        // вариант 2:
        // строка физически шире заголовка.
        //
        // если расширяемая колонка одна,
        // дополнительная физическая колонка
        // относится именно к ней.

        Если Не НужноРасширить И РазницаКолонок > 0
            И КоличествоРасширяемыхКолонок = 1 Тогда

            НужноРасширить = Истина;

        КонецЕсли;

        // если число дополнительных физических колонок
        // равно числу расширяемых колонок,
        // значит расширились все такие колонки.

        Если Не НужноРасширить И РазницаКолонок > 0
            И РазницаКолонок = КоличествоРасширяемыхКолонок Тогда

            НужноРасширить = Истина;

        КонецЕсли;

        Если НужноРасширить Тогда

            ДополнительнаяКолонка = Новый Структура;
            ДополнительнаяКолонка.Вставить("Имя", Правило.ИмяДополнительнойКолонки);
            ДополнительнаяКолонка.Вставить("Расширяемая", Ложь);
            ДополнительнаяКолонка.Вставить("ИмяДополнительнойКолонки", "");
            СхемаКолонок.Добавить(ДополнительнаяКолонка);

        КонецЕсли;

    КонецЦикла;

    Возврат СхемаКолонок;

КонецФункции

Функция ПолучитьПравилаРасширенияКолонок()

    Правила = Новый Массив;

    Правило = Новый Структура;
    Правило.Вставить("ИмяКолонки", "Количество");
    Правило.Вставить("ИмяДополнительнойКолонки", "ДобЕдИзм"); //чтоб не совпала с имеющейся

    Правила.Добавить(Правило);

    Возврат Правила;
	
КонецФункции

Функция ПолучитьПравилоРасширенияКолонки(Знач ИмяКолонки, Правила)

    ИмяКолонки = НРег(СокрЛП(ИмяКолонки));

    Для Каждого Правило Из Правила Цикл

        Если НРег(СокрЛП(Правило.ИмяКолонки)) = ИмяКолонки Тогда
            Возврат Правило;
        КонецЕсли;

    КонецЦикла;

    Возврат Неопределено;
	
КонецФункции

Процедура ДобавитьДополнительнуюКолонку(СхемаКолонок, ИндексКолонки)

    Колонка = СхемаКолонок[ИндексКолонки];

    ДополнительнаяКолонка = Новый Структура;
    ДополнительнаяКолонка.Вставить("Имя", Колонка.ИмяДополнительнойКолонки);
    ДополнительнаяКолонка.Вставить("Расширяемая", Ложь);
    ДополнительнаяКолонка.Вставить( "ИмяДополнительнойКолонки", "");

    СхемаКолонок.Вставить(ИндексКолонки + 1, ДополнительнаяКолонка);
		
КонецПроцедуры
	
Функция ПолучитьКоличествоФизическихКолонок(ТаблицаТоваров, ЕстьЗаголовок)

    Если ТаблицаТоваров.Количество() = 0 Тогда
        Возврат 0;
    КонецЕсли;

    ИндексСтроки = 0;

    Если ЕстьЗаголовок Тогда
        ИндексСтроки = 1;
    КонецЕсли;

    Если ИндексСтроки >= ТаблицаТоваров.Количество() Тогда
        Возврат 0;
    КонецЕсли;

    Возврат ТаблицаТоваров[ИндексСтроки].Количество();

КонецФункции 

Функция ОпределитьВариантСхемыТаблицы(ТаблицаТоваров, СхемаКолонок, ЕстьЗаголовок)

    КоличествоЛогическихКолонок = СхемаКолонок.Количество();

    КоличествоФизическихКолонок = ПолучитьКоличествоФизическихКолонок(ТаблицаТоваров, ЕстьЗаголовок);

    Если КоличествоФизическихКолонок = 0 Тогда
        Возврат "НесовместимаяСхема";
	КонецЕсли;
	
	Если КоличествоФизическихКолонок > КоличествоЛогическихКолонок Тогда
        Возврат "НесовместимаяСхема";
    КонецЕсли;
	
	ИндексСтроки = 0;
	
	Если ЕстьЗаголовок Тогда
        ИндексСтроки = 1;
    КонецЕсли;
	
    Если ИндексСтроки >= ТаблицаТоваров.Количество() Тогда
        Возврат "НесовместимаяСхема";
	КонецЕсли;
	
	СтрокаТаблицы = ТаблицаТоваров[ИндексСтроки];
	
	Для ИндексКолонки = 0 По СхемаКолонок.Количество() - 1 Цикл

        Колонка = СхемаКолонок[ИндексКолонки];

        Если Не Колонка.Расширяемая Тогда
            Продолжить;
        КонецЕсли;

        Если ИндексКолонки >= СтрокаТаблицы.Количество() Тогда
            Продолжить;
        КонецЕсли;

        Значение = СокрЛП(СтрокаТаблицы[ИндексКолонки]);

        ЧисловаяЧасть = ПолучитьЧисловуюЧасть(Значение);
        СтроковаяЧасть = ПолучитьСтроковуюЧасть(Значение);

        Если СтроковаяЧасть <> "" Тогда
            Возврат "ОбъединеннаяСхема";
        КонецЕсли;

    КонецЦикла;

    Возврат "ЛогическаяСхема";

КонецФункции

#КонецОбласти

#Область Служебные 

Функция ЭтоТипДокумента(СтрокаMarkdown)

	Возврат
		Найти(НРег(СтрокаMarkdown), "поступление товаров") > 0 
		Или Найти(НРег(СтрокаMarkdown), "поступление тмз") > 0
		Или Найти(НРег(СтрокаMarkdown), "реализация товаров") > 0
		Или Найти(НРег(СтрокаMarkdown), "реализация тмз") > 0
		Или Найти(НРег(СтрокаMarkdown), "приходная накладная") > 0
		Или Найти(НРег(СтрокаMarkdown), "расходная накладная") > 0;

КонецФункции

Функция ЭтоРеквизит(СтрокаMarkdown)

	Возврат Найти(СтрокаMarkdown, ":") > 0;

КонецФункции

Процедура ОпределитьТипДокумента(Документ, СтрокаMarkdown)

	Строка = НРег(СтрокаMarkdown);
	
	Если Найти(Строка, "поступление") > 0 
		ИЛИ Найти(Строка, "приходная") Тогда
		Документ.ТипДокумента = "Поступление";
	ИначеЕсли Найти(Строка, "реализация") > 0 
		ИЛИ Найти(Строка, "расходная") 
		Тогда
		Документ.ТипДокумента = "Реализация";
	КонецЕсли;

	Документ.ТипОбъекта = "Документ";

КонецПроцедуры

Процедура ЗаполнитьДатуНомерДокумента(Документ, СтрокаMarkdown)
	
	СтрокаСДатой = ПривестиДату(СтрокаMarkdown);
    Документ.РеквизитыДокумента.ДатаДокумента = СтроковыеФункцииКлиентСервер.СтрокаВДату(СтрокаСДатой);
	Документ.РеквизитыДокумента.НомерДокумента = НайтиНомерДокумента(НРег(СтрокаMarkdown));
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитДокумента(Документ, СтрокаMarkdown)
	
	Позиция = Найти(СтрокаMarkdown, ":");

	Если Позиция = 0 Тогда
		Возврат;
	КонецЕсли;

	ИмяРеквизита = НРег(СокрЛП(Лев(СтрокаMarkdown, Позиция - 1)));
	Значение = СокрЛП(Сред(СтрокаMarkdown, Позиция + 1));

	Соответствия = DR_DocumentFactory.СоответствиеРеквизитовДокумента();

	Если Соответствия.Получить(ИмяРеквизита) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Документ.ТипДокумента = "Поступление" И ИмяРеквизита = "покупатель" Тогда
		ИмяПоля = Соответствия.Получить("организация");
	ИначеЕсли Документ.ТипДокумента = "Поступление" И ИмяРеквизита = "поставщик" Тогда
		ИмяПоля = Соответствия.Получить("поставщик");	
	ИначеЕсли Документ.ТипДокумента = "Реализация" И ИмяРеквизита = "поставщик" Тогда
		ИмяПоля = Соответствия.Получить("организация");
	ИначеЕсли Документ.ТипДокумента = "Реализация" И ИмяРеквизита = "покупатель" Тогда
		ИмяПоля = Соответствия.Получить("покупатель");
	Иначе
		ИмяПоля = Соответствия.Получить(ИмяРеквизита);	
	КонецЕсли;
	
	Если ТипЗнч(Документ.РеквизитыДокумента[ИмяПоля]) = Тип("Число") Тогда
		Значение = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Значение);
	КонецЕсли;
	
	Документ.РеквизитыДокумента.Вставить(ИмяПоля, Значение);
	
КонецПроцедуры 

Функция НайтиСПозиции(Строка, ИскомаяСтрока, Позиция)

	Если Позиция > СтрДлина(Строка) Тогда
		Возврат 0;
	КонецЕсли;

	Фрагмент = Сред(Строка, Позиция);
	НайденнаяПозиция = Найти(Фрагмент, ИскомаяСтрока);

	Если НайденнаяПозиция = 0 Тогда
		Возврат 0;
	КонецЕсли;

	Возврат Позиция + НайденнаяПозиция - 1;

КонецФункции

Функция ПривестиДату(Знач СтрокаСДатой)

	
	Месяца = Новый Массив;
	Месяца.Добавить("января"); 
	Месяца.Добавить("февраля");
    Месяца.Добавить("марта");
	Месяца.Добавить("апреля");
	Месяца.Добавить("мая");
	Месяца.Добавить("июня");
	Месяца.Добавить("июля");
	Месяца.Добавить("августа");
	Месяца.Добавить("сентября");
	Месяца.Добавить("октября");
	Месяца.Добавить("ноября");
	Месяца.Добавить("декабря");
   
	Для Каждого Месяц Из Месяца Цикл
    	Если СтрНайти(НРег(СтрокаСДатой), Месяц) > 0 Тогда
    		НомерМесяца = Формат(Месяца.Найти(Месяц) + 1, "ЧЦ=2; ЧВН=; ЧГ=0");
        	СтрокаСДатой = СтрЗаменить(НРег(СтрокаСДатой), " " + Месяц + " ", "." + Строка(НомерМесяца) + "."); 
    Прервать;
    	КонецЕсли;
    КонецЦикла;

	Символ = Найти(НРег(СтрокаСДатой),"от");
	СтрокаСДатой = (СокрЛП(Сред(СтрокаСДатой, Символ + 2, СтрДлина(СтрокаСДатой) - Символ)));
	
	Возврат СтрокаСДатой;
	
КонецФункции 

Функция НайтиНомерДокумента(Знач СтрокаСНомером)
	
	СимволыНомер = Найти(СтрокаСНомером, "№");
	СимволыОТ = Найти(СтрокаСНомером, "от");
	СтрокаДата = (СокрЛП(Сред(СтрокаСНомером, СимволыНомер + 1, СимволыОТ - СимволыНомер - 1)));
	
	Возврат СтрокаДата;
	
КонецФункции

Функция ПолучитьСтроковуюЧасть(Знач СтрокаЗначение)
	
	Возврат СокрЛП(СтрСоединить(СтрРазделить(СтрокаЗначение, "0123456789", Ложь), ""));
	
КонецФункции

Функция ПолучитьЧисловуюЧасть(Знач СтрокаСЧислом)
	
   РезультатЧисло = "";

   Для Индекс = 1 По СтрДлина(СтрокаСЧислом) Цикл
       Символ = Сред(СтрокаСЧислом, Индекс, 1);
       КодСимвола = КодСимвола(Символ);
       Если ((КодСимвола >= 48 И КодСимвола <= 57) Или (Символ = "-" И Индекс = 1)
           Или (Символ = ",") Или (Символ = ".") Или (Символ = " ") Или (КодСимвола = 160)) Тогда
           Если КодСимвола <> 32 И КодСимвола <> 160 Тогда
               РезультатЧисло = РезультатЧисло + Символ;
           КонецЕсли;
       Иначе
           Прервать;
       КонецЕсли;
   КонецЦикла;

   Возврат РезультатЧисло;
	
КонецФункции

Функция ПроверитьПоследнийСимволВСтроке(Знач СтрокаЗначение)
	
	КодСимвола = КодСимвола(Прав(СокрЛП(СтрокаЗначение),1));

	Если КодСимвола < 48 ИЛИ КодСимвола > 57 Тогда
    	Возврат Истина
	КонецЕсли;
	Возврат Ложь; 
	
КонецФункции

Функция СоздатьРезультатДокумента(Документ, JSON)

	Результат = Новый Структура;

	Результат.Вставить("Document", Документ);
	Результат.Вставить("Markdown", "");
	Результат.Вставить("JSON", JSON);
	Результат.Вставить("Ошибка", "");

	Возврат Результат;

КонецФункции

Функция СоздатьРезультатОшибки(ТекстОшибки)

	Результат = Новый Структура;

	Результат.Вставить("Document", Неопределено);
	Результат.Вставить("Markdown", "");
	Результат.Вставить("JSON", "");
	Результат.Вставить("Ошибка", ТекстОшибки);

	Возврат Результат;

КонецФункции

#КонецОбласти
















