////////////////////////////////////////////////////////////////////////////////
// 
// Copyright (C) 2026 Yezhi-NI
// SPDX-License-Identifier: AGPL-3.0-only
// Project: https://github.com/Yezhi-NI/DoRIS
// Contact: https://t.me/afterdev 
//
////////////////////////////////////////////////////////////////////////////////
//
// DoRIS(Дорис)
//
// Общий модуль: DR_RecognitionService
//
// Назначение:
//  - проверка входных параметров;
//  - получение настроек;
//  - выбор OCR-провайдера;
//  - вызов OCR-провайдера;
//  - вызов DR_DocumentProcessor;
//  - вызов DR_DocumentFactory;
//  - формирование массива результатов.
//
////////////////////////////////////////////////////////////////////////////////

Функция РаспознатьМассивФайлов(Знач МассивФайловДляРаспознавания) Экспорт

    DR_Validation.ПроверитьТипМассив(МассивФайловДляРаспознавания, "МассивАдресовФайловВХранилище");

    Настройки = DR_Settings.ПолучитьНастройки();

    Провайдер = Настройки.ПровайдерOCR;
	
    Результаты = Новый Массив;

    Для Каждого СтруктураРаспознавания Из МассивФайловДляРаспознавания Цикл

        РезультатРаспознавания = РаспознатьФайл(Провайдер, Настройки, СтруктураРаспознавания);
		Если НЕ ЗначениеЗаполнено(РезультатРаспознавания.Ошибка) Тогда
			РезультатРаспознавания.Вставить("ТабДокумент", 
				DR_DocumentFactory.ПечатьНакладная(РезультатРаспознавания.Document.ТабличнаяЧасть)); 
			РезультатРаспознавания.Удалить("Document");
		КонецЕсли;
        Результаты.Добавить(РезультатРаспознавания);

    КонецЦикла;
	
	АдресХранилищаРезультаты = ПоместитьВоВременноеХранилище(Результаты);
	Возврат АдресХранилищаРезультаты;

КонецФункции

Функция РаспознатьФайл(Провайдер, Настройки, Знач СтруктураРаспознавания)
	//для тестирования
	//РезультатOCR = "";
	//-----------------
	
	РезультатOCR = Провайдер.ВыполнитьРаспознавание(Настройки, СтруктураРаспознавания.ФайлРаспознавания);
	
	//не проверяем РезультатOCR.Статус, при неудаче возвращаем сырой json адаптера
	
	//Если РезультатOCR.Статус = DR_Settings.СтатусыРаспознавания().Ошибка Тогда
	//   	Возврат РезультатOCR;
	//КонецЕсли;

    РезультатDocumentProcessor = DR_DocumentProcessor.Обработать(РезультатOCR);
	
	Если ЗначениеЗаполнено(РезультатDocumentProcessor.Ошибка) Тогда
		Возврат РезультатDocumentProcessor;
	КонецЕсли;

	Если Константы.DR_ПоказатьТабличныйДокумент.Получить() ИЛИ 
		НЕ ЗначениеЗаполнено(СтруктураРаспознавания.ОбъектЗаполнения) Тогда
		Возврат РезультатDocumentProcessor;
	КонецЕсли;
	
	РезультатDocumentFactory = DR_DocumentFactory.СоздатьДокумент(РезультатDocumentProcessor, 
		СтруктураРаспознавания.ОбъектЗаполнения);
	
	Возврат РезультатDocumentFactory;
	
КонецФункции

 

