
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//если открыт из формы объекта
	Если Параметры.Свойство("ОбъектЗаполнения") Тогда
		ОбъектЗаполнения = Параметры.ОбъектЗаполнения;
       	ТипОбъектаЗаполнения = Параметры.ТипОбъекта;
	КонецЕсли;
	
	ПолучитьАктивныйПровайдер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(ОбъектЗаполнения) Тогда
    	ВыбратьФайлИРаспознатьСодержимое();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РаспознатьТест(Команда)
	
	ВыбратьФайлИРаспознатьСодержимое();

КонецПроцедуры

&НаСервере
Функция РаспознатьМассивФайловНаСервере(Знач МассивФайловДляРаспознавания)
	
	Результат = DR_RecognitionService.РаспознатьМассивФайлов(МассивФайловДляРаспознавания);
	Возврат Результат;

КонецФункции

&НаКлиенте
Асинх Процедура ВыбратьФайлИРаспознатьСодержимое()
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие); 
	ДиалогВыбора.Заголовок = "Выберите документ";
	ДиалогВыбора.МножественныйВыбор = Ложь;
	ДиалогВыбора.Фильтр = "(*.pdf,*.jpg,*.jpeg)|*.pdf;*.jpg;*.jpeg";
	Обещание = ДиалогВыбора.ВыбратьАсинх();
	
	ВыбранныеВДиалогеФайлы = Ждать Обещание;
	
	Если ВыбранныеВДиалогеФайлы = Неопределено Тогда 
		Если НЕ ОбъектЗаполнения = Неопределено Тогда
			ЭтаФорма.Закрыть();
		КонецЕсли;
    	Возврат;
	Конецесли;
	
	ПутьКВыбранномуФайлу = ВыбранныеВДиалогеФайлы[0];
	
	Если НЕ ПроверитьРазмерФайла(ПутьКВыбранномуФайлу) Тогда
		Если НЕ ОбъектЗаполнения = Неопределено Тогда
			ЭтаФорма.Закрыть();
		КонецЕсли;
		ВызватьИсключение "Размер файла превышает 10 MB";
	Конецесли;
	
	МассивДляРаспознавания = Новый Массив;
	СтруктураРаспознавания = Новый Структура;
	ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКВыбранномуФайлу);
	АдресФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
	РасширениеФайла = ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ПутьКВыбранномуФайлу);
	Файл = Новый Структура;
	Файл.Вставить("АдресФайла", АдресФайла);
	Файл.Вставить("ТипФайла", РасширениеФайла);
 
	СтруктураРаспознавания.Вставить("ФайлРаспознавания", Файл); 
	СтруктураРаспознавания.Вставить("ОбъектЗаполнения", ОбъектЗаполнения);
	МассивДляРаспознавания.Добавить(СтруктураРаспознавания);
	
	ВыполнитьРаспознавание(МассивДляРаспознавания); 

КонецПроцедуры

&НаКлиенте
Асинх Процедура ОбработатьРезультатРаспознавания(Знач АдресРезультатРаспознавания)
	
	РезультатРаспознавания = ПолучитьИзВременногоХранилища(АдресРезультатРаспознавания);
    УдалитьИзВременногоХранилища(АдресРезультатРаспознавания);
	
	Если ТипЗнч(РезультатРаспознавания) = Тип("Массив") Тогда
		Если ЗначениеЗаполнено(РезультатРаспознавания[0].Ошибка) Тогда
			Если ЗначениеЗаполнено(ОбъектЗаполнения) Тогда
				ЭтаФорма.Закрыть();
			КонецЕсли;
			ВызватьИсключение РезультатРаспознавания[0].Ошибка;
		Иначе
			Если РезультатРаспознавания[0].Свойство("ТабДокумент") Тогда
				Если НЕ РезультатРаспознавания[0].ТабДокумент = Неопределено Тогда
					РезультатРаспознавания[0].ТабДокумент.Показать(); 
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(ОбъектЗаполнения) Тогда
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьРазмерФайла(ПроверяемыйФайл)
	
	РазмерФайла = Новый Файл(ПроверяемыйФайл);	
	РазмерФайла = РазмерФайла.Размер();
	
	Если Окр(РазмерФайла / 1024 / 1024, 2) > 10 Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ПолучитьКонстантуDR_НеСоздаватьДокументы()
	
	Если Константы.DR_ПоказатьТабличныйДокумент.Получить() Тогда
		Возврат Истина;
    КонецЕсли;	
	
	Возврат Ложь;

КонецФункции

&НаКлиенте
Процедура ОткрытьФормуНастройки(Команда) 
	
	ПараметрыОповещения = Новый Структура;    
    Оповещение = Новый ОписаниеОповещения("ОткрытьФормуНастройкиЗавершение",ЭтотОбъект,ПараметрыОповещения);
    ПараметрыФормы = Новый Структура;
 	ОткрытьФорму("Обработка.DR_РаспознаваниеДокументов.Форма.ФормаНастройка",,,,,,Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастройкиЗавершение(Параметры, ДополнительныеПараметры) Экспорт
	
	ПолучитьАктивныйПровайдер();
	
КонецПроцедуры
	
&НаСервере
Процедура ПолучитьАктивныйПровайдер()
	
	АктивныйПровайдер = Константы.DR_АктивныйАдаптер.Получить();
	
КонецПроцедуры	

&НаКлиенте
Процедура ВыполнитьРаспознавание(МассивДляРаспознавания) 
	
	ДлительнаяОперация = ПолучитьДанныеРапознавания(УникальныйИдентификатор, МассивДляРаспознавания);
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		ПослеПолучитьДанныеРапознавания(ДлительнаяОперация, Неопределено);
		Возврат
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПослеПолучитьДанныеРапознавания", ЭтотОбъект);
	ПараметрыОжидания     = ОбщегоНазначенияИСМПТККлиентПереопределяемый.ПараметрыОжидания(ЭтаФорма); 
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ПараметрыОжидания.ТекстСообщения 	=  НСтр("ru = 'Получение данных из НКТ.'");
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьДанныеРапознавания(Знач УникальныйИдентификатор, МассивДляРаспознавания)
	
	НаименованиеЗадания = НСтр("ru = 'Получение данных рапознавания файлов.'");
	ИмяМетода           = "DR_RecognitionService.РаспознатьМассивФайлов";
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания; 
	ПараметрыВыполнения.ЗапуститьНеВФоне = Истина;
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ИмяМетода, МассивДляРаспознавания);
	
КонецФункции

&НаКлиенте
Процедура ПослеПолучитьДанныеРапознавания(Результат, ДополнительныеПараметры) Экспорт 
	
 	ПослеПолученияДанныхРаспознавания(Результат, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПолученияДанныхРаспознавания(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ТекстИсключения = НСтр("ru = 'Произошла ошибка при получении данных с сервера.'" + Символы.ПС); 
		Если Результат.Свойство("ИнформацияОбОшибке") Тогда
			ТекстИсключения = ТекстИсключения + Результат.ИнформацияОбОшибке.Описание;
		КонецЕсли;
		Если НЕ ОбъектЗаполнения = Неопределено Тогда
			ЭтаФорма.Закрыть();
		КонецЕсли;
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	ОтветРезультат = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	
	ОбработатьРезультатРаспознавания(ОтветРезультат);
	
КонецПроцедуры






