////////////////////////////////////////////////////////////////////////////////
// 
// Copyright (C) 2026 Yezhi-NI
// SPDX-License-Identifier: AGPL-3.0-only
// Project: https://github.com/Yezhi-NI/DoRIS
// Contact: https://t.me/afterdev  
//
////////////////////////////////////////////////////////////////////////////////
//
// DoRIS(Дорис)
//
// Общий модуль:
//      DR_Validation
//
// Назначение:
//      Проверка входных параметров.
//
////////////////////////////////////////////////////////////////////////////////

//переделать под БСП

Процедура ПроверитьТипСтрока(Значение, ИмяПараметра) Экспорт

    ПроверитьТип(Значение, Тип("Строка"), ИмяПараметра);

КонецПроцедуры

Процедура ПроверитьТипСтруктура(Значение, ИмяПараметра) Экспорт

    ПроверитьТип( Значение, Тип("Структура"), ИмяПараметра);

КонецПроцедуры

Процедура ПроверитьТипМассив(Значение, ИмяПараметра) Экспорт

    ПроверитьТип( Значение, Тип("Массив"), ИмяПараметра);

КонецПроцедуры

Процедура ПроверитьТипБулево(Значение, ИмяПараметра) Экспорт

    ПроверитьТип( Значение, Тип("Булево"), ИмяПараметра);

КонецПроцедуры

Процедура ПроверитьТипЧисло(Значение, ИмяПараметра) Экспорт

    Если Не ТипЗнч(Значение) = Тип("Число") Тогда

        ВызватьИсключение( СтрШаблон("Параметр '%1' должен иметь тип Число.", ИмяПараметра));

    КонецЕсли;

КонецПроцедуры

Процедура ПроверитьЗаполнено(Значение, ИмяПараметра) Экспорт

    Если Не ЗначениеЗаполнено(Значение) Тогда

        ВызватьИсключение(СтрШаблон("Параметр '%1' не заполнен.", ИмяПараметра));

    КонецЕсли;

КонецПроцедуры

Процедура ВызватьИсключениеОшибки(ОписаниеОшибки) Экспорт

    ВызватьИсключение ОписаниеОшибки;

КонецПроцедуры

Процедура ПроверитьТип(Значение, ОжидаемыйТип, ИмяПараметра)

    Если ТипЗнч(Значение) <> ОжидаемыйТип Тогда

        ВызватьИсключение( СтрШаблон( "Параметр '%1' имеет неверный тип.", ИмяПараметра));

    КонецЕсли;

КонецПроцедуры
