////////////////////////////////////////////////////////////////////////////////
// 
// Copyright (C) 2026 Yezhi-NI
// SPDX-License-Identifier: AGPL-3.0-only
// Project: https://github.com/Yezhi-NI/DoRIS
// Contact: https://t.me/afterdev 
//
////////////////////////////////////////////////////////////////////////////////
//
// DoRIS(Дорис)
//
// Общий модуль: DR_DocumentFactory
//
// Назначение:
// Фабрика объектов Document.
// Не содержит логики обработки.
// Используется для создания структур документа, для создания документов и справочников.
//
////////////////////////////////////////////////////////////////////////////////

#Область СтруктураДанных

Функция СоздатьСтруктуруДокумент() Экспорт

	Документ = Новый Структура;

	Документ.Вставить("ТипОбъекта", "");
	Документ.Вставить("ТипДокумента", ""); 
	Документ.Вставить("МассивСтрок", "");	
	Документ.Вставить("РеквизитыДокумента", СоздатьРеквизитыДокумента());
	Документ.Вставить("ТабличнаяЧасть", СоздатьТабличнуюЧастьДокумента());

	Возврат Документ;

КонецФункции

Функция СоздатьРеквизитыДокумента() Экспорт

	Реквизиты = Новый Структура;

	Реквизиты.Вставить("Контрагент", "");
	Реквизиты.Вставить("Организация", "");
	Реквизиты.Вставить("ДатаДокумента", Неопределено);
	Реквизиты.Вставить("НомерДокумента", "");
	Реквизиты.Вставить("Валюта", "");
	Реквизиты.Вставить("СуммаДокумента", 0);
	Реквизиты.Вставить("Комментарий", "");
	
	Возврат Реквизиты;

КонецФункции

Функция СоздатьТабличнуюЧастьДокумента() Экспорт
	
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("НомерСтроки",,"НомерСтроки"); 
	ТаблицаТоваров.Колонки.Добавить("Номенклатура",,"Номенклатура"); 
	ТаблицаТоваров.Колонки.Добавить("ЕИ",,"ЕдиницаИзмерения"); 
	ТаблицаТоваров.Колонки.Добавить("Количество",,"Количество"); 
	ТаблицаТоваров.Колонки.Добавить("Цена",,"Цена"); 
	ТаблицаТоваров.Колонки.Добавить("СуммаБезНДС",,"СуммаБезНДС"); 
	ТаблицаТоваров.Колонки.Добавить("СуммаНДС",,"СуммаНДС"); 
	ТаблицаТоваров.Колонки.Добавить("Сумма",,"СуммаСНДС"); 
	ТаблицаТоваров.Колонки.Добавить("GTIN",,"GTIN"); 
	ТаблицаТоваров.Колонки.Добавить("NTIN",,"NTIN"); 
	ТаблицаТоваров.Колонки.Добавить("СтавкаНДС",,"СтавкаНДС"); 
	ТаблицаТоваров.Колонки.Добавить("Артикул",,"Артикул"); 
	ТаблицаТоваров.Колонки.Добавить("Код",,"Код");	
	Возврат ТаблицаТоваров;

КонецФункции

Функция СоздатьСтрокуТабличнойЧасти() Экспорт

	СтрокаТабличнойЧасти = Новый Структура;

	СтрокаТабличнойЧасти.Вставить("НомерСтроки", 0);
	СтрокаТабличнойЧасти.Вставить("Номенклатура", "");
	СтрокаТабличнойЧасти.Вставить("ЕдиницаИзмерения", "");
	СтрокаТабличнойЧасти.Вставить("Количество", 0);
	СтрокаТабличнойЧасти.Вставить("Цена", 0);
	СтрокаТабличнойЧасти.Вставить("СуммаБезНДС", 0);
	СтрокаТабличнойЧасти.Вставить("GTIN", "");
	СтрокаТабличнойЧасти.Вставить("NTIN", "");
	СтрокаТабличнойЧасти.Вставить("НДС", 0);
	СтрокаТабличнойЧасти.Вставить("СуммаНДС", 0);
	СтрокаТабличнойЧасти.Вставить("Сумма", 0);
	СтрокаТабличнойЧасти.Вставить("Артикул", "");

	Возврат СтрокаТабличнойЧасти;

КонецФункции 

Функция СоответствиеРеквизитовДокумента() Экспорт

	Соответствие = Новый Соответствие;
	Соответствие.Вставить("контрагент", "Контрагент");
	Соответствие.Вставить("поставщик", "Контрагент");
	Соответствие.Вставить("покупатель", "Контрагент");
	Соответствие.Вставить("организация", "Организация");
	Соответствие.Вставить("дата", "ДатаДокумента");
	Соответствие.Вставить("документ дата", "ДатаДокумента");
	Соответствие.Вставить("дата документа", "ДатаДокумента");
	Соответствие.Вставить("номер", "НомерДокумента");
	Соответствие.Вставить("номер документа", "НомерДокумента");
	Соответствие.Вставить("валюта", "Валюта");
	Соответствие.Вставить("сумма", "СуммаДокумента");
	Соответствие.Вставить("итого", "СуммаДокумента");
	Соответствие.Вставить("всего", "СуммаДокумента");
	Соответствие.Вставить("комментарий", "Комментарий");
	Соответствие.Вставить("примечание", "Комментарий");

	Возврат Соответствие;

КонецФункции 

Функция СоответствиеКолонок() Экспорт

	Соответствие = Новый Соответствие;
    Соответствие.Вставить("№", "НомерСтроки");
	Соответствие.Вставить("Код", "Код");
	Соответствие.Вставить("Артикул", "Артикул");
	Соответствие.Вставить("Товар", "Номенклатура");
    Соответствие.Вставить("Количество", "Количество"); 
	Соответствие.Вставить("ЕдиницаИзмерения", "ЕдиницаИзмерения");
	Соответствие.Вставить("Цена", "Цена");
	Соответствие.Вставить("Сумма", "Сумма");
	Соответствие.Вставить("GTIN", "GTIN");
	Соответствие.Вставить("NTIN", "NTIN");
	Соответствие.Вставить("НДС", "НДС");
	Соответствие.Вставить("СуммаНДС", "СуммаНДС");
	Соответствие.Вставить("СуммаСНДС", "СуммаСНДС");
	Возврат Соответствие;

КонецФункции 

#КонецОбласти

#Область СозданиеЗаполнение

//определение документа или срправочника для создания 
Функция СоздатьДокумент(Документ, ОбъектЗаполнения) Экспорт
	
	//пропускаем проверку типов и заполнение 
	
	//определяем тип объекта и тип документа
	Если Документ.Document.ТипОбъекта = "Документ" Тогда 
		Результат = ЗаполнитьДокумент(Документ.Document, ОбъектЗаполнения);
	КонецЕсли;		
	
	Документ.Ошибка = Результат;
	Возврат Документ;
	
КонецФункции

//заполняемТЧ документа
Функция ЗаполнитьДокумент(Документ, ОбъектЗаполнения) 
	
	ТекстОшибки = "";
	ДокОбъект = ОбъектЗаполнения.ПолучитьОбъект();
	
	Попытка
	
	Для Каждого СтрокаТаблицы ИЗ Документ.ТабличнаяЧасть Цикл
		//лучше искать по штрихкоду. нужно добавить поиск по шк и нтин
		СтрокаТоваров = ДокОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТоваров, СтрокаТаблицы); 
		Если ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
			ЭлНоменклатура = НайтиЭлементСправочника(СтрокаТаблицы.Номенклатура, "Номенклатура");
			Если ЗначениеЗаполнено(ЭлНоменклатура) Тогда
				СтрокаТоваров.Номенклатура = ЭлНоменклатура;	
			    СтрокаТоваров.СтавкаНДС = ЭлНоменклатура.СтавкаНДС;
				СтрокаТоваров.ЕдиницаИзмерения = ЭлНоменклатура.БазоваяЕдиницаИзмерения;
			КонецЕсли;
		КонецЕсли;
		
		СтрокаТоваров.Коэффициент = 1;
		СтрокаТоваров.СуммаНДС = УчетНДСиАкцизаКлиентСервер.РассчитатьСуммуНДС(СтрокаТоваров.Сумма, Истина, 
			ДокОбъект.СуммаВключаетНДС, УчетНДСиАкцизаВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтрокаТоваров.СтавкаНДС),,);

	КонецЦикла;
	
	ТоварыЗаполнитьСчетаУчета(ДокОбъект);
	ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	Исключение
		ТекстОшибки = "Не удалось создать и записать документ";
	КонецПопытки;
	
	Возврат ТекстОшибки;	
			
КонецФункции

Процедура ТоварыЗаполнитьСчетаУчета(ОбъектЗаполнения)
	
	Документы.ПоступлениеТоваровУслуг.ЗаполнитьСчетаУчетаВТабличнойЧасти(ОбъектЗаполнения, "Товары");

КонецПроцедуры

Функция НайтиЭлементСправочника(ЭлПоиска, ТипЭлемента)
	
	ОбъектСсылка = Неопределено;
	Запрос = Новый Запрос;
    Запрос.Текст = ТекстЗапроса(ТипЭлемента);
	Запрос.УстановитьПараметр("Наименование", ЭлПоиска);
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбъектСсылка = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат ОбъектСсылка;
	
КонецФункции

Функция ТекстЗапроса(ТипЭлемента) 
	
	ТекстЗапроса = "";
	
	Если ТипЭлемента = "Контрагент" Тогда
	
		ТекстЗапроса = 	
			"ВЫБРАТЬ
			|	Контрагенты.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	Контрагенты.Наименование = &Наименование";

	 ИначеЕсли ТипЭлемента = "Номенклатура" Тогда
	
		ТекстЗапроса = 	
			"ВЫБРАТЬ
			|	Номенклатура.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	Номенклатура.Наименование = &Наименование";

	 ИначеЕсли ТипЭлемента = "ЕИ" Тогда
	
		ТекстЗапроса = 	
			"ВЫБРАТЬ
			|	КлассификаторЕдиницИзмерения.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
			|ГДЕ
			|	КлассификаторЕдиницИзмерения.Наименование = &Наименование";
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
			
КонецФункции

Функция НайтиКонтрагента(Контрагент) 
	
	КонтрагентСсылка = Справочники.Контрагенты.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КонтрагентСсылка = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат КонтрагентСсылка;
			
КонецФункции

&НаСервере
Функция ПечатьНакладная(ТаблицаДляПечати) Экспорт
	
	Если НЕ Константы.DR_ПоказатьТабличныйДокумент.Получить() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
	Макет = Обработки.DR_РаспознаваниеДокументов.ПолучитьМакет("МакетТаблица");
	
	ТабДокумент = Новый ТабличныйДокумент;
	ШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицыСКодом");
	Строка = Макет.ПолучитьОбласть("СтрокаСКодом");
	
	ТабДокумент.Вывести(ШапкаТаблицы);

	Для Каждого СтрокаТаблицы ИЗ ТаблицаДляПечати Цикл	
		Строка.Параметры.Заполнить(СтрокаТаблицы);
       	ТабДокумент.Вывести(Строка);
	КонецЦикла;
			
	Возврат ТабДокумент;
	
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

#КонецОбласти

