////////////////////////////////////////////////////////////////////////////////
// 
// Copyright (C) 2026 Yezhi-NI
// SPDX-License-Identifier: AGPL-3.0-only
// Project: https://github.com/Yezhi-NI/DoRIS
// Contact: https://t.me/afterdev 
//
////////////////////////////////////////////////////////////////////////////////
//
// DoRIS(Дорис)
//
// Общий модуль:
//      DR_HttpClient
//
// Назначение:
//  - создание HTTP-соединения;
//  - выполнение GET/POST запросов;
//  - установка HTTP-заголовков;
//  - поддержка HTTPS;
//  - поддержка multipart/form-data;
//  - поддержка application/json;
//  - возврат результата HTTP-запроса.
//
////////////////////////////////////////////////////////////////////////////////

Функция ОтправитьGETЗапрос(HTTPЗапрос_) Экспорт

    DR_Validation.ПроверитьТипСтруктура(HTTPЗапрос_, "HTTPЗапрос_");

    Попытка

        Соединение = СоздатьHTTPСоединение(HTTPЗапрос_);
        ЗапросHTTP = СоздатьHTTPЗапрос(HTTPЗапрос_);
        УстановитьЗаголовки(ЗапросHTTP, HTTPЗапрос_.Заголовки);
        Ответ = Соединение.ВызватьHTTPМетод("GET", ЗапросHTTP);
        Возврат СоздатьHTTPРезультат(Ответ);

    Исключение
        Возврат СоздатьHTTPРезультатОшибки(ОписаниеОшибки());
    КонецПопытки;

КонецФункции

Функция ОтправитьPOSTЗапрос(HTTPЗапрос) Экспорт

	DR_Validation.ПроверитьТипСтруктура(HTTPЗапрос, "HTTPЗапрос_");

	Попытка

		Соединение = СоздатьHTTPСоединение(HTTPЗапрос);
		ЗапросHTTP = СоздатьHTTPЗапрос(HTTPЗапрос);

		УстановитьЗаголовки(ЗапросHTTP, HTTPЗапрос.Заголовки);

		Если HTTPЗапрос.ДвоичныеДанные = Неопределено Тогда
			ДобавитьПараметрыJSON(ЗапросHTTP, HTTPЗапрос.Параметры);
		Иначе
			СформироватьMultipart(ЗапросHTTP, HTTPЗапрос);
		КонецЕсли;

		Ответ = Соединение.ОтправитьДляОбработки(ЗапросHTTP);
		Возврат СоздатьHTTPРезультат(Ответ);

	Исключение
		Возврат СоздатьHTTPРезультатОшибки(ОписаниеОшибки());
	КонецПопытки;

КонецФункции

Функция ПолучитьСтруктуруHTTPЗапроса() Экспорт

	СтруктураЗапрос = Новый Структура;

	СтруктураЗапрос.Вставить("Сервер", "");
	СтруктураЗапрос.Вставить("Порт", 443);
	СтруктураЗапрос.Вставить("URL", ""); 
	СтруктураЗапрос.Вставить("АдресСервиса", "");
	СтруктураЗапрос.Вставить("Заголовки", Новый Структура);
	СтруктураЗапрос.Вставить("Параметры", Неопределено);
	СтруктураЗапрос.Вставить("ДвоичныеДанные", Неопределено);
	СтруктураЗапрос.Вставить("ТипФайла", "");
	СтруктураЗапрос.Вставить("ИмяПоляФайла", "file");
	СтруктураЗапрос.Вставить("ИмяФайла", "123");
	СтруктураЗапрос.Вставить("Пользователь", "");
	СтруктураЗапрос.Вставить("Пароль", "");
	СтруктураЗапрос.Вставить("Прокси", Неопределено);
	СтруктураЗапрос.Вставить("Таймаут", 60);

	Возврат СтруктураЗапрос;

КонецФункции

Функция СоздатьHTTPЗапрос(HTTPЗапрос_)
	
	HTTPЗапрос = Новый HTTPЗапрос();
	HTTPЗапрос.АдресРесурса = HTTPЗапрос_.АдресСервиса;
	Возврат HTTPЗапрос;

КонецФункции

Функция СоздатьHTTPСоединение(HTTPЗапрос_)

    ЗащищенноеСоединение =
        Новый ЗащищенноеСоединениеOpenSSL();
    HTTPСоединение = Новый HTTPСоединение(
        HTTPЗапрос_.URL,
        HTTPЗапрос_.Порт,
        HTTPЗапрос_.Пользователь,
        HTTPЗапрос_.Пароль,
        HTTPЗапрос_.Прокси,
        HTTPЗапрос_.Таймаут,
        ЗащищенноеСоединение);
		
    Возврат HTTPСоединение; 

КонецФункции

Функция СоздатьHTTPРезультат(HTTPОтвет)

	Результат = Новый Структура;
	Результат.Вставить("КодСостояния", HTTPОтвет.КодСостояния);
	Результат.Вставить("Тело", ПолучитьТелоОтвета(HTTPОтвет));
	Результат.Вставить("Заголовки", HTTPОтвет.Заголовки); 
	Результат.Вставить("Ошибка", "");

	Возврат Результат;

КонецФункции

Функция ПолучитьТелоОтвета(HTTPОтвет)

	Попытка
		Возврат HTTPОтвет.ПолучитьТелоКакСтроку();
	Исключение
		Возврат "";
	КонецПопытки;

КонецФункции

Функция СоздатьHTTPРезультатОшибки(ТекстОшибки)

	Результат = Новый Структура;
	Результат.Вставить("КодСостояния", 0);
	Результат.Вставить("Тело", "");
	Результат.Вставить("Заголовки", Новый Структура);
	Результат.Вставить("Ошибка", ТекстОшибки);

	Возврат Результат;

КонецФункции 

Процедура УстановитьЗаголовки(ЗапросHTTP, Заголовки)

	Если Заголовки = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Для Каждого Заголовок Из Заголовки Цикл
		ЗапросHTTP.Заголовки.Вставить(Заголовок.Ключ, Заголовок.Значение);
	КонецЦикла;

КонецПроцедуры

Процедура ДобавитьПараметрыJSON(ЗапросHTTP, Параметры)

	Если Параметры = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();

	ЗаписатьJSON(ЗаписьJSON, Параметры);

	ЗапросHTTP.УстановитьТелоИзСтроки(ЗаписьJSON.Закрыть());

КонецПроцедуры
                                                                                  
Процедура СформироватьMultipart(ЗапросHTTP, HTTPЗапрос_)
	

	Граница = СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "");

	лПоток = Новый ПотокВПамяти; 
	Поток = Новый ЗаписьДанных(лПоток);

	ДобавитьПоляMultipart(Поток, Граница, HTTPЗапрос_.Параметры);

	ДобавитьФайлMultipart(Поток, Граница, HTTPЗапрос_);

	Поток.Записать(СтрокаВДвоичныеДанные("--" + Граница + "--" + Символы.ПС));
	
	Поток.Закрыть();
	
	ДанныеТела = лПоток.ЗакрытьИПолучитьДвоичныеДанные();
	
	ЗапросHTTP.УстановитьТелоИзДвоичныхДанных(ДанныеТела);
	
	ЗапросHTTP.Заголовки.Вставить("Content-Type","multipart/form-data; boundary=" + Граница);

КонецПроцедуры

Процедура ДобавитьПоляMultipart(Поток, Граница, Параметры)

	Если Параметры = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Для Каждого Параметр Из Параметры Цикл

		Поток.Записать(СтрокаВДвоичныеДанные("--" + Граница + Символы.ПС));

		Поток.Записать(СтрокаВДвоичныеДанные("Content-Disposition: form-data; name=""" +
				Параметр.Ключ +
				"""" +
				Символы.ПС +
				Символы.ПС));

		Поток.Записать(СтрокаВДвоичныеДанные(Строка(Параметр.Значение) + Символы.ПС));

	КонецЦикла;

КонецПроцедуры

Процедура ДобавитьФайлMultipart(Поток, Граница, HTTPЗапрос_)

	Поток.Записать(СтрокаВДвоичныеДанные("--" + Граница + Символы.ПС));

	Поток.Записать(СтрокаВДвоичныеДанные("Content-Disposition: form-data; name=""" +
			HTTPЗапрос_.ИмяПоляФайла +
			"""; filename=""" +
			HTTPЗапрос_.ИмяФайла +
			"""" +
			Символы.ПС));

	Поток.Записать(СтрокаВДвоичныеДанные("Content-Type: " +
			HTTPЗапрос_.ТипФайла +
			Символы.ПС +
			Символы.ПС));

	Поток.Записать(HTTPЗапрос_.ДвоичныеДанные);

	Поток.Записать(СтрокаВДвоичныеДанные(Символы.ПС));

КонецПроцедуры

Функция СтрокаВДвоичныеДанные(Строка)

	Поток = Новый ПотокВПамяти;
	Запись = Новый ЗаписьТекста(Поток, КодировкаТекста.UTF8);

	Запись.Записать(Строка);
	Запись.Закрыть();

	Возврат Поток.ЗакрытьИПолучитьДвоичныеДанные();

КонецФункции

Функция ПроверитьHTTPОтвет(HTTPРезультат) Экспорт

	Если HTTPРезультат.КодСостояния >= 200
		И HTTPРезультат.КодСостояния < 300 Тогда

		Возврат Истина;

	КонецЕсли;

	Возврат Ложь;

КонецФункции















